{
    "version": "https://jsonfeed.org/version/1",
    "title": "",
    "home_page_url": "/",
    "feed_url": "/feed.json",
    "items": [
        {
            "id": "/blog/2022/12/23/community-spotlight-december-2022/",
            "url": "/blog/2022/12/23/community-spotlight-december-2022/",
            "title": "Cadence Community Spotlight Update - December 2022",
            "summary": "I know we are a little early this month as many people will be taking some time out for holidays.\n\nHappy Holidays\n\nWe'd like to wish everyone happy holidays and to thank you for being part of the Cadence community. It's been a busy year for Cadence as we have continued to build a strong, active community that works together to solve issues and generally support each other.\n\nLet's keep going!...This is a great way to build a sustainable community.\n\nWe are sure that 2023 will be even more exciting as we continue to develop Cadence.\n\nCadence in the News!\n\nBelow are a selection of Cadence related articles, blogs and whitepapers. Please take a look and feel free to share via your own social media channels.\n\nCadence iWF\n\nChild Workflow Cookbook\n\n[Cadence Connection Examples Using TLS](https://www.instaclus ...",
            "date_modified": "2022-12-23T00:00:00.000Z"
        },
        {
            "id": "/blog/2022/11/30/community-spotlight-november-2022/",
            "url": "/blog/2022/11/30/community-spotlight-november-2022/",
            "title": "Cadence Community Spotlight Update - November 2022",
            "summary": "Here’s the latest in our regular monthly Community Spotlight updates that gives you news from in and around the Cadence community!\n\nPlease see below for a roundup of the highlights:\n\nCadence @ Uber\n\nThis month Uber Engineering published a really nice article on one of the ways they are using Cadence. The article is called How Uber Optimizes the Timing of Push Notifications using ML and Linear Programming.\n\nThe Uber team take you through the details of the problem that they are looking to solve, so you can understand the scope limitations and depedencies - so please take a look.\n\nCadence @ DeveloperWeek Enterprise\n\nDevNetwork run a series of conferences and during November Cadence was featured in at DeveloperWeek Enterprise. Ender Demirkaya and [Ben Slater](https://www.linkedin.com/in/ ...",
            "date_modified": "2022-11-30T00:00:00.000Z"
        },
        {
            "id": "/blog/2022/10/31/community-spotlight-october-2022/",
            "url": "/blog/2022/10/31/community-spotlight-october-2022/",
            "title": "Cadence Community Spotlight Update - October 2022",
            "summary": "Here’s the latest in our regular monthly Community Spotlight updates that gives you news from in and around the Cadence community!\n\nPlease see below for a roundup of the highlights:\n\nCadence Meetup Postponed\n\nIt's always great to get the community together and we had planned to run another Cadence Meetup in early November. Unfortunately we didn't have enough time to get things organised so we've decided to postpone it. So please watch out for an announcement for the new Cadence meetup date.\n\nDoordash Technnical Showcase Featuring Cadence\n\nWe have had some great feedback from people who attended Technical Showcase that was run this month by Doordash. It featured their financial products but also highlighted some of the key technologies they use...and guess what Cadence is one of them!\n\nIf you missed the session then you will be happy to know that it was recorded and we've inlcuded a link to the the recording on Youtube.\n\nThanks to ...",
            "date_modified": "2022-10-31T00:00:00.000Z"
        },
        {
            "id": "/blog/2022/10/11/community-spotlight-september-2022/",
            "url": "/blog/2022/10/11/community-spotlight-september-2022/",
            "title": "Cadence Community Spotlight Update - September 2022",
            "summary": "Here’s the latest in our regular monthly Community Spotlight updates that gives you news from in and around the Cadence community!\n\nPlease see below for a roundup of the highlights:\n\nCadence at Developer Week\n\nA Cadence talk by Ender Demirkaya and Ben Slater has been accepted for Developer Week Enterprise.\n\nThe talk is scheduled to for 16th November so please make a note in your calendars.\n\nSharing Knowledge\n\nOver the last few months we have had a continual stream of Cadence questions in our Slack #support channel or on StackOverflow. As a result of the increased interest some members from the Cadence core team have decided to spend some time each day responding to your questions.\n\nRemember that if you have received a response ...",
            "date_modified": "2022-10-11T00:00:00.000Z"
        },
        {
            "id": "/blog/2022/08/31/community-spotlight-august-2022/",
            "url": "/blog/2022/08/31/community-spotlight-august-2022/",
            "title": "Cadence Community Spotlight Update - August 2022",
            "summary": "Here’s the latest in our regular monthly Community Spotlight updates that gives you news from in and around the Cadence community!\n\nPlease see below for a roundup of the highlights:\n\nCommunity Survey\n\nWe are working on putting together our first community survey to find out a bit more about our community. We would like to get your feedback about on a few things such as:\n\nhow you are using Cadence\nany specific experiences you have had where you'd like to see new features\nany special use cases not yet covered\nand of course whatever other feedback you'd like to give us\n\nSo please watch out for the survey which will be coming out to you via the Slack channel soon!\n\nSupport Activity\n\nWe have noticed that community activity is increasing and that we are continuing to respond to questions in our Slack #support channel. Eight questions have been posted in the channel this month and another seven questions have been posted on StackOverflow. We encourage people to post their questi ...",
            "date_modified": "2022-08-31T00:00:00.000Z"
        }
    ]
}