{
    "version": "https://jsonfeed.org/version/1",
    "title": "",
    "home_page_url": "/",
    "feed_url": "/feed.json",
    "items": [
        {
            "id": "/blog/2023/07/05/implement-cadence-worker-from-scratch/",
            "url": "/blog/2023/07/05/implement-cadence-worker-from-scratch/",
            "title": "Implement a Cadence worker service from scratch",
            "summary": "In the previous blog, we have introduced three critical components for a Cadence application: the Cadence backend, domain, and worker. Among these, the worker service is the most crucial focus for developers as it hosts the activities and workflows of a Cadence application. In this blog, I will provide a short tutorial on how to implement a simple worker service from scratch in Go.\n\nTo finish this tutorial, there are two prerequisites you need to finish first\nRegister a Cadence domain for your worker. For this tutorial, I've already registered a domain named test-domain\nStart the Cadence backend server in background. You may find the instruction here\n\nTo get started, let's simply use the native HTTP package built in Go to start a process listening to port 3000. You may customize the port for your worker, but the port you choose should not conflict with existing port ...",
            "date_modified": "2023-07-05T00:00:00.000Z"
        },
        {
            "id": "/blog/2023/07/01/components-of-cadence-application-setup/",
            "url": "/blog/2023/07/01/components-of-cadence-application-setup/",
            "title": "Understanding components of Cadence application",
            "summary": "Cadence is a powerful, scalable, and fault-tolerant workflow orchestration framework that helps developers implement and manage complex workflow tasks. In most cases, developers contribute activities and workflows directly to their codebases, and they may not have a full understanding of the components behind a running Cadence application. We receive numerous inquiries about setting up Cadence in a local environment from scratch for testing. Therefore, in this article, we will explore the components that power a Cadence cluster.\n\nThere are three critical components that are essential for any Cadence application:\nA running Cadence backend server.\nA registered Cadence domain.\nA running Cadence worker that registers all workflows and activities.\n\nLet's go over these components in more details.\n\nThe Cadence backend serves as the heart of your Cadence application. It is responsible for processing and scheduling your workflows and activities. While the backend relies on various dep ...",
            "date_modified": "2023-07-01T00:00:00.000Z"
        },
        {
            "id": "/blog/2023/06/30/community-spotlight-june-2023/",
            "url": "/blog/2023/06/30/community-spotlight-june-2023/",
            "title": "Cadence Community Spotlight Update - June 2023",
            "summary": "We've had a short break but now we are back. Welcome to the latest of our regular monthly Community Spotlight updates that gives you news from in and around the Cadence community!\n\nPlease see below for a roundup of the highlights:\n\nCadence Release 1.0\n\nJust in case you missed it - at the end of April Cadence v1.0 was officially released. This release is a significant milestone for the project and the community. It indicates that we are confident in the stability of the code that we can recommend it and promote it widely to more users. Kudos to everyone that worked together to make this release happen.\n\nAnd the Uber team also gave Cadence a writeup on the Uber Engineering Blog so please take a look.\n\nCommunity Survey Results\n\nThe results of our Community Survey have been published and you can find [the details right here on our blog](https://cadenceworkflow.io/blog/2 ...",
            "date_modified": "2023-06-30T00:00:00.000Z"
        },
        {
            "id": "/blog/2023/06/08/survey-results/",
            "url": "/blog/2023/06/08/survey-results/",
            "title": "2023 Cadence Community Survey Results",
            "summary": "We released a user survey earlier this year to learn about who our users are, how they use Cadence, and how we can help them. It was shared from our Slack workspace, cadenceworkflow.io Blog and LinkedIn. After collecting the feedback, we wanted to share the results with our community. Thank you everyone for filling it out! Your feedback is invaluable and it helps us shape our roadmap for the future.\n\nHere are some highlights in text and you can check out the visuals to get more details:\n\nusing.png\n\njob_role.png\n\nMost of the people who replied to our survey were engineers who were already using Cadence, actively evaluating, or migrating from a similar technology. This was exciting to hear! Some of you have contacted us to learn more about benchmarks, scale, and ideal ...",
            "image": "/../../shared/img/2023-survey-results/using.png",
            "date_modified": "2023-06-08T00:00:00.000Z"
        },
        {
            "id": "/blog/2023/03/31/community-spotlight-march-2023/",
            "url": "/blog/2023/03/31/community-spotlight-march-2023/",
            "title": "Cadence Community Spotlight Update - March 2023",
            "summary": "Welcome to the latest of our regular monthly Community Spotlight updates that gives you news from in and around the Cadence community!\n\nPlease see below for a roundup of the highlights:\n\nCadence at Open Source Summit, North America\nWe are very pleased to let you know that a talk on Cadence has been accepted for the Linux Foundation's Open Source Summit, North America in Vancouver on 10th - 12th May 2023.\n\nThe talk called Cadence: The New Open Source Project for Building Complex Distributed Applications will be given by Ender Demirkaya and Emrah Seker If you are planning to attend the Open Source Summit then please don't forget to attend the talk and take time catch up with Ender and Emrah!\n\nCommunity Activity\nOur Slack #support channel has been very active over the last fe ...",
            "date_modified": "2023-03-31T00:00:00.000Z"
        }
    ]
}